@extends('layouts.app')

@section('content')
<!-- Секция "Главный экран" -->
<section class="hero">

    <div class="container">
        <h1 class="hero-title">Agutables - создавайте, редактируйте и делитесь таблицами онлайн!</h1>
        <p class="hero-subtitle">Современный способ управления данными и совместной работы с командой.</p>
        <svg width="388.5680259146342" height="291.35625000000005" viewBox="0 0 450 328" class="looka-1j8o68f">
            <defs id="SvgjsDefs1692"></defs>
            <g id="SvgjsG1693" featurekey="rootContainer" transform="matrix(1,0,0,1,0,0)" fill="#111111">
                <path xmlns="http://www.w3.org/2000/svg" fill-rule="evenodd" d=" M0,0 H450 V328 H0,0 z M2,2 H448 V326 H2,2 z M6,6 H444 V322 H6 z M8,8 H442 V320 H6,8 z "></path>
            </g>
            <g id="SvgjsG1694" featurekey="symbolFeature-0" transform="matrix(1.5555641268978755,0,0,1.5555641268978755,147.94221168041307,42.220623172379064)" fill="#111111">
                <path xmlns="http://www.w3.org/2000/svg" d="M86.229,50.001l0.721-0.723c10.115-10.115,10.116-26.574,0-36.69s-26.575-10.116-36.691,0l-0.722,0.721l-0.721-0.721  C38.7,2.472,22.24,2.472,12.124,12.588C2.008,22.704,2.008,39.163,12.125,49.278l0.721,0.723l-0.721,0.721  C2.008,60.838,2.008,77.296,12.124,87.414c10.117,10.115,26.577,10.115,36.692,0l0.721-0.722l0.722,0.722  c10.116,10.115,26.575,10.115,36.691,0c10.116-10.118,10.115-26.576,0-36.692L86.229,50.001z M53.453,15.783  c8.354-8.354,21.947-8.354,30.3,0c8.354,8.354,8.354,21.948,0.001,30.301L59.431,70.407c-1.862,1.863-2.316,4.073-0.109,6.306  l0.831,0.806c4.66,4.66,12.242,4.66,16.902,0s4.66-12.243,0.001-16.903l-0.722-0.722l1.751-1.75l0.722,0.722  c5.627,5.625,5.627,14.78,0,20.405c-5.625,5.625-14.781,5.625-20.406,0c0,0-0.354-0.298-0.833-0.78  c-0.44-0.447-4.823-4.899,0.112-9.835l24.322-24.323c7.389-7.388,7.389-19.409,0-26.798c-7.388-7.387-19.408-7.387-26.796,0.001  l-0.723,0.721l-1.752-1.751L53.453,15.783z M73.86,74.325c-2.899,2.897-7.615,2.897-10.514,0l-0.721-0.722l10.513-10.513l0.722,0.72  C76.758,66.71,76.758,71.425,73.86,74.325z M15.319,15.783c8.354-8.354,21.948-8.354,30.302,0l24.321,24.321l-1.752,1.754  L43.868,17.535c-7.389-7.388-19.408-7.388-26.796,0c-7.389,7.388-7.389,19.409,0,26.797l0.721,0.722l-1.752,1.752l-0.722-0.721  C6.965,37.731,6.965,24.138,15.319,15.783z M62.626,26.398l0.721-0.722c2.898-2.898,7.614-2.898,10.514,0  c2.897,2.898,2.897,7.613,0,10.514l-0.722,0.721L62.626,26.398z M24.337,58.297l-2.319,2.318c-4.661,4.66-4.66,12.243,0,16.903  c4.659,4.66,12.242,4.66,16.902,0l0.722-0.722c3.561-3.559-0.725-7.104-2.787-9.167l-1.343-1.354l-6.383-6.383l1.752-1.75  l8.49,8.489l0.67,0.672c6.242,6.239,1.837,10.76,1.353,11.244l-0.722,0.722c-5.626,5.628-14.78,5.625-20.407,0  c-5.625-5.625-5.625-14.78,0.001-20.407L44.59,34.54l1.751,1.754L34.23,48.403L24.337,58.297z M25.934,63.091l10.513,10.51  l-0.722,0.723c-2.899,2.897-7.614,2.899-10.512,0c-2.898-2.898-2.898-7.615,0-10.513L25.934,63.091z M49.536,39.488l10.512,10.513  L49.536,60.512L39.023,50.001L49.536,39.488z M38.921,22.483c-4.66-4.662-12.243-4.66-16.902,0c-4.66,4.658-4.661,12.242,0,16.902  l0.721,0.722l-1.752,1.751l-0.722-0.721c-5.626-5.627-5.625-14.781,0-20.408c5.627-5.625,14.781-5.626,20.407,0l24.323,24.323  l-1.752,1.752L38.921,22.483z M36.447,26.399L25.934,36.911l-0.721-0.721c-2.899-2.899-2.899-7.615-0.001-10.514  c2.898-2.898,7.614-2.898,10.513,0.002L36.447,26.399z M83.753,84.218c-8.353,8.354-21.946,8.354-30.3,0l-0.909-0.813  c-0.198-0.199-1.873-1.863-3.107-4.434c-1.151,2.43-2.679,4.096-3.094,4.525l-0.722,0.722c-8.354,8.354-21.948,8.354-30.302,0  c-8.354-8.354-8.354-21.947,0-30.303l24.323-24.321l1.752,1.753L17.072,55.669c-7.389,7.389-7.389,19.409,0,26.797  c7.388,7.389,19.408,7.389,26.796,0l0.761-0.762c1.918-1.991,3.366-5.064,3.473-8.229c0-0.093,0.007-0.186,0.009-0.277  c0.022-2.474-0.788-4.981-2.86-7.055c-1.284-1.284-3.86-3.86-3.86-3.86l-0.371-0.395l-6.942-6.941l1.752-1.753l9.693,9.693  l0.813,0.828c1.438,1.439,2.459,2.871,3.161,4.269c0.705-1.348,1.705-2.73,3.102-4.128l0.134-0.148l24.324-24.322  c4.659-4.66,4.659-12.244-0.001-16.904c-4.659-4.66-12.242-4.66-16.902,0l-0.722,0.723l-1.751-1.752l0.721-0.723  c5.625-5.625,14.781-5.625,20.406,0c5.627,5.627,5.627,14.781,0,20.406L54.482,65.46l-0.767,0.77  c-4.868,4.868-2.956,11.839,0.604,15.397l0.886,0.839c7.388,7.389,19.408,7.389,26.796,0c7.389-7.388,7.389-19.408,0-26.797  l-0.722-0.722l1.752-1.753l0.722,0.723C92.107,62.271,92.107,75.863,83.753,84.218z"></path>
            </g>
            <g id="SvgjsG1695" featurekey="nameFeature-0" transform="matrix(2.2105996719990357,0,0,2.2105996719990357,50.2652727617529,188.51298957160475)" fill="#111111">
                <path d="M15.12 40 l-2.04 -8.36 l-7.76 0 l-2.04 8.36 l-3.4 0 l8 -30 l2.76 0 l7.96 30 l-3.48 0 z M9.32 15.8 l-3.16 12.44 l6.08 0 z M27.611 40.36 c-2.5067 0 -4.3932 -0.71332 -5.66 -2.14 s-1.9 -3.4867 -1.9 -6.18 l0 -14 c0 -2.7467 0.64 -4.82 1.92 -6.22 s3.2933 -2.1 6.04 -2.1 c2.5867 0 4.5068 0.70668 5.76 2.12 s1.88 3.4533 1.88 6.12 l0 2.8 l-3.48 0 l0 -3.2 c0 -0.58668 -0.06 -1.16 -0.18 -1.72 s-0.34 -1.06 -0.66 -1.5 s-0.75332 -0.79332 -1.3 -1.06 s-1.2467 -0.4 -2.1 -0.4 s-1.5666 0.12 -2.14 0.36 s-1.0333 0.58 -1.38 1.02 s-0.58668 0.98 -0.72 1.62 s-0.2 1.36 -0.2 2.16 l0 14.16 c0 1.6267 0.3 2.84 0.9 3.64 s1.7 1.2 3.3 1.2 c1.76 0 2.96 -0.42 3.6 -1.26 s0.96 -1.9933 0.96 -3.46 l0 -4.8 l-5.64 -0.04 l0 -3.4 l9.04 0.04 l0 7.92 c0 2.72 -0.62 4.7868 -1.86 6.2 s-3.3 2.12 -6.18 2.12 z M46.902 40.36 c-2.4267 0 -4.32 -0.71328 -5.68 -2.14 s-2.04 -3.4867 -2.04 -6.18 l0 -22.04 l3.48 0 l0 21.96 c0 0.56 0.07332 1.1333 0.22 1.72 s0.38 1.1067 0.7 1.56 s0.74668 0.82664 1.28 1.12 s1.1866 0.44 1.96 0.44 c0.88 0 1.6133 -0.12668 2.2 -0.38 s1.0534 -0.62 1.4 -1.1 s0.59336 -1.0533 0.74004 -1.72 s0.22 -1.4 0.22 -2.2 l0 -21.4 l3.44 0 l0 22.04 c0 2.7467 -0.65332 4.82 -1.96 6.22 s-3.2934 2.1 -5.96 2.1 z M67.033 13.64 l0 26.36 l-3.6 0 l0 -26.36 l-5.88 0 l0 -3.64 l15.36 0 l0 3.64 l-5.88 0 z M86.08400000000002 40 l-2.04 -8.36 l-7.76 0 l-2.04 8.36 l-3.4 0 l8 -30 l2.76 0 l7.96 30 l-3.48 0 z M80.28400000000002 15.8 l-3.16 12.44 l6.08 0 z M105.09500000000001 37.76 c-0.77332 0.77332 -1.6932 1.3402 -2.7599 1.7002 s-2.2534 0.54 -3.56 0.54 l-6.92 0 l0 -30 l6.04 0 c1.5733 0 2.8866 0.22 3.94 0.66 s1.9 1.0333 2.54 1.78 s1.0933 1.6067 1.36 2.58 s0.4 1.9933 0.4 3.06 c0 1.0933 -0.27332 2.1 -0.82 3.02 s-1.18 1.7267 -1.9 2.42 c0.10668 0.05332 0.20668 0.12 0.3 0.2 s0.20664 0.16 0.33996 0.24 c0.34668 0.29332 0.73336 0.64664 1.16 1.06 s0.82 0.90664 1.18 1.48 s0.66 1.2266 0.9 1.96 s0.36 1.5533 0.36 2.46 c0 1.4933 -0.22 2.8066 -0.66 3.94 s-1.0733 2.1 -1.9 2.9 z M98.73500000000001 13.48 l-3.48 -0.000039062 l0 8.68 l3.88 0 c0.50668 0 0.98668 -0.10668 1.44 -0.32 s0.85332 -0.5 1.2 -0.86 s0.61336 -0.79332 0.80004 -1.3 s0.28 -1.04 0.28 -1.6 c0 -0.48 -0.06 -0.98668 -0.18 -1.52 s-0.33332 -1.0266 -0.64 -1.48 s-0.72668 -0.83332 -1.26 -1.14 s-1.2133 -0.46 -2.04 -0.46 z M98.97500000000002 25.6 l-3.72 0 l0 10.84 l3.12 0 c0.74668 0 1.48 -0.09332 2.2 -0.28 s1.36 -0.48668 1.92 -0.9 s1.0067 -0.96 1.34 -1.64 s0.5 -1.5267 0.5 -2.54 c0 -1.8933 -0.51332 -3.28 -1.54 -4.16 s-2.3 -1.32 -3.82 -1.32 z M110.74600000000002 40 l0 -30 l3.4 0 l0 26.4 l8.96 0 l0 3.6 l-12.36 0 z M125.95700000000002 40 l0 -30 l14.72 0 l0 3.76 l-11.36 0 l0 9.24 l11.28 0 l0 3.32 l-11.28 0 l0 9.92 l11.64 0 l0 3.76 l-15 0 z M150.568 40.36 c-1.3333 0 -2.5199 -0.2 -3.5599 -0.6 s-1.9 -1.0267 -2.58 -1.88 s-1.18 -1.96 -1.5 -3.32 s-0.44 -2.9867 -0.36 -4.88 l3.68 0 c0 0.96 0.02668 1.8867 0.08 2.78 s0.20664 1.68 0.45996 2.36 s0.64664 1.22 1.18 1.62 s1.2933 0.6 2.28 0.6 c0.85332 0 1.5666 -0.12668 2.14 -0.38 s1.0333 -0.59332 1.38 -1.02 s0.59336 -0.93336 0.74004 -1.52 s0.22 -1.2134 0.22 -1.88 c-0.02668 -1.44 -0.5 -2.5867 -1.42 -3.44 s-2.1 -1.5866 -3.54 -2.2 c-1.1733 -0.48 -2.22 -0.96668 -3.14 -1.46 s-1.6867 -1.06 -2.3 -1.7 s-1.08 -1.3867 -1.4 -2.24 s-0.48 -1.9066 -0.48 -3.16 c0 -2.7733 0.70668 -4.8532 2.12 -6.24 s3.4133 -2.08 6 -2.08 c2.2667 0 4.06 0.70668 5.38 2.12 s1.98 3.48 1.98 6.2 l0 2.84 l-3.52 0 l0 -3.04 c0 -1.44 -0.31332 -2.6 -0.94 -3.48 s-1.62 -1.32 -2.98 -1.32 c-1.68 0 -2.8667 0.44 -3.56 1.32 s-1.0133 2.12 -0.96 3.72 c0.02668 0.66668 0.14 1.24 0.34 1.72 s0.48668 0.9 0.86 1.26 s0.82664 0.69332 1.36 1 s1.16 0.62 1.88 0.94 c0.88 0.4 1.7533 0.82668 2.62 1.28 s1.6734 1 2.42 1.64 c0.77332 0.69332 1.4266 1.5333 1.96 2.52 s0.8 2.1867 0.8 3.6 c0 2.72 -0.68 4.7868 -2.04 6.2 s-3.2267 2.12 -5.6 2.12 z"></path>
            </g>
        </svg>
        <div class="mt-3">
            @if(!Auth::check())
            <a href="{{route('login')}}" class="btn " style="font-size: 1.7rem; background: rgb(15 151 126);">Авторизация</a>
            @elseif(Auth::check())
            <a href="{{route('books.index')}}" class="btn btn-success" style="font-size: 1.7rem;">Начать бесплатно</a>
            @endif
        </div>
    </div>
</section>

<!-- Секция "О нас" -->
<section id="about" class="about">
    <div class="container">
        <h2 class="section-title">О нас</h2>
        <p class="section-description">Agutables - это инновационный онлайн сервис, который позволяет пользователям создавать, редактировать и делиться таблицами в реальном времени. Мы стремимся упростить вашу работу с данными и обеспечить эффективное взаимодействие в команде.</p>
    </div>
</section>

<!-- Секция "Возможности" -->
<section id="features" class="features">
    <div class="container">
        <h2 class="section-title">Возможности Agutables</h2>
        <div class="container d-flex justify-content-center">
            <div class="row">
                <div class="col-md-4">
                    <div class="feature">
                        <img src="{{url('image/tables.png')}}" alt="Возможность создавать таблицы" class="feature-icon" style="width: 7rem; height: 7rem;">
                        <h3 class="feature-title">Создавайте таблицы</h3>
                        <p class="feature-description">Создавайте новые таблицы и управляйте их структурой и данными.</p>
                    </div>
                </div>
                <div class="col-md-4">
                    <div class="feature">
                        <img src="{{url('image/pencil.png')}}" alt="Возможность редактировать таблицы" class="feature-icon" style="width: 7rem; height: 7rem;">
                        <h3 class="feature-title">Редактируйте таблицы</h3>
                        <p class="feature-description">Редактируйте содержимое таблиц, добавляйте новые строки и столбцы.</p>
                    </div>
                </div>
                <div class="col-md-4">
                    <div class="feature">
                        <img src="{{url('image/share.png')}}" alt="Возможность делиться таблицами" class="feature-icon">
                        <h3 class="feature-title">Делитесь таблицами</h3>
                        <p class="feature-description">Делитесь своими таблицами с коллегами и друзьями, назначайте им различные уровни доступа.</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</section>

<!-- Секция "Инструкции" -->
<section id="instructions" class="instructions">
    <div class="container">
        <h2 class="section-title">Инструкции по использованию Agutables</h2>
        <div class="container d-flex justify-content-center">
            <div class="row">
                <div class="col-md-6">
                    <div class="instruction">
                        <img src="{{ url('image/register.png') }}" alt="Регистрация" class="instruction-icon">
                        <p>Зарегистрируйтесь на сайте Agutables или войдите в свою учетную запись.</p>
                    </div>
                </div>
                <div class="col-md-6">
                    <div class="instruction">
                        <img src="{{ url('image/create_table.png') }}" alt="Создание таблицы" class="instruction-icon">
                        <p>Создайте новую таблицу или выберите существующую для редактирования.</p>
                    </div>
                </div>
                <div class="col-md-6">
                    <div class="instruction">
                        <img src="{{ url('image/share_table.png') }}" alt="Делитесь таблицей" class="instruction-icon">
                        <p>При необходимости, делитесь таблицей с другими пользователями, назначая им нужные уровни доступа.</p>
                    </div>
                </div>
                <div class="col-md-6">
                    <div class="instruction">
                        <img src="{{ url('image/work_realtime.png') }}" alt="Работа в реальном времени" class="instruction-icon">
                        <p>Работайте с данными в режиме реального времени, независимо от того, где вы находитесь, с использованием функционала Agutables.</p>
                    </div>
                </div>
                <div class="col-md-12 text-center">
                    <p class="instruction-note">Просто и эффективно!</p>
                </div>
            </div>
        </div>
    </div>
</section>
<section id="contact" class="contact">
    <div class="container">
        <h2 class="section-title">Контакты</h2>
        <p class="section-description">Если у вас возникли вопросы или предложения, пожалуйста, свяжитесь с нами.</p>
        <a href="mailto:intkt03@mail.ru" class="email">intkt03@mail.ru</a>
    </div>
</section>
<link rel="stylesheet" href="{{url('/style/indexstyle.css')}}">
@endsection